Revit 2027 API
DirectContext3DHandleSettings.Assign Method
 Assigns values of the source settings to this object.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Assign(
	DirectContext3DHandleSettings other
)
Public Sub Assign (
	other As DirectContext3DHandleSettings
)
public:
void Assign(
	DirectContext3DHandleSettings^ other
)
member Assign :
        other : DirectContext3DHandleSettings -> unit
Parameters
other DirectContext3DHandleSettings
 The source settings.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace